## `terraform/scheduling`
#### Terraform Format and Style 🖌`success`
#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
data.aws_iam_role.task_role: Reading...
module.custom_domain.data.aws_route53_zone.mydomain: Reading...
data.aws_iam_role.task_execution_role: Reading...
data.aws_vpc.myvpc: Reading...
data.aws_sns_topic.my_sns: Reading...
data.aws_security_group.fargate_sg: Reading...
module.custom_domain.data.aws_route53_zone.mydomain: Read complete after 1s [id=Z0885897H6FS59VX1SAQ]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.custom_cloudwatch.aws_cloudwatch_log_group.firelens will be created
  + resource "aws_cloudwatch_log_group" "firelens" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/ecs/minecraft-firelens-logs"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # module.custom_ecs.aws_ecs_cluster.main will be created
  + resource "aws_ecs_cluster" "main" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "minecraft-test-cluster"
      + tags               = {
          + "environment" = "test"
          + "owners"      = "minecraft"
        }
      + tags_all           = {
          + "environment" = "test"
          + "owners"      = "minecraft"
        }

      + configuration {
          + execute_command_configuration {
              + logging = "DEFAULT"
            }
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
Releasing state lock. This may take a few moments...
```

</details>